Revit 2024 API
MacroModule.Dispose Method
Releases all resources used by the MacroModule
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace